gdgly/NUC97X_JS/STM32F4xx/DL698/RM_3762_iActive_HPLC.c

#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/RM_3762_iActive.h"
#include "../DL698/RM_3762_RouterActive.h"
#include "../DL698/Uart_3762_RxTx.h"
#include "../DL698/RM_RS485.h"
#include "../DL698/TASK.h"
#include "../DL698/RM_TASK.h"
#include "../DL698/RM_TxDATA.h"
#include "../DL698/RM_RxDATA.h"
#include "../DL698/RM_Record.h"

#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../Device/MEMRW.h"
#include "../Display/Warning.h"
#include "../Calculate/Calculate.h"

#include "../DL698/DL698_JSON.h"

#if ((Project/100)==2)||((Project/100)==4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
void Find_Next_CollectAddr(u32 PORTn,u32 id)
{
	u32 i;
	#ifdef DEBUG_JSON
	u32 z;
	#endif
	u32 SETNO;
	u8 *pADDR_6000;
	UARTCtrl_TypeDef *UARTCtrl;
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);

	pADDR_6000=(u8 *)(ADDR_6000_SDRAM);
	SETNO=UARTCtrl->MeterCount[id];

	pADDR_6000+=SETNO*LENper_6000;
	for(i=SETNO;i<NUM_RMmax;i++)
	{
		if(pADDR_6000[0]!=DataType_structure)
		{
			pADDR_6000+=LENper_6000;
			continue;
		}
		break;
	}
	if(i>=NUM_RMmax)
	{
		pADDR_6000=(u8 *)(ADDR_6000_SDRAM);
		i=0;
		for(;i<SETNO;i++)
		{
			if(pADDR_6000[0]!=DataType_structure)
			{
				pADDR_6000+=LENper_6000;
				continue;
			}
			break;
		}
		if(i>=SETNO)
		{
			return;
		}
	}
	UARTCtrl->MeterCount[id]=i;
#ifdef DEBUG_JSON
	myprintf("[%s:%d]:成功找到了档案中下一只表的位置:%d\n",(u32)&__func__,(u32)__LINE__,i);
	pADDR_6000+=10;
	for(z=0;z<6;z++)
	{	
		myprintf("%02x",pADDR_6000[z],0,0);
	}
	myprintf("\n",0,0,0);
#endif
}

u32 Get_ListNo(u8* p8)//得到并发列表号;入口:抄表地址;返回:列表号0-(NUM_RMLISTmax-1)(>=NUM_RMLISTmax表示无效)
{
	u32 ListNo;
	u32 ListTask;
	u32 Addr0;
	u32 Addr1;
	u32 Addr2;
	u32 i;
//	u16 *pAddr;
	u32 x;
	u64 d64a;
	u64 d64b;
	
	Addr0=p8[0]|(p8[1]<<8);
	Addr1=p8[2]|(p8[3]<<8);
	Addr2=p8[4]|(p8[5]<<8);
	
	
	for(ListNo=0;ListNo<NUM_RMLISTmax;ListNo++)
	{
		ListTask=RMLIST->List[ListNo].TASK;////0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
		if((ListTask>=1)&&(ListTask<=6))//0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
		{//有效
			if(Addr0!=RMLIST->List[ListNo].RMAddr[0])
			{
				continue;
			}
			if(Addr1!=RMLIST->List[ListNo].RMAddr[1])
			{
				continue;
			}
			if(Addr2!=RMLIST->List[ListNo].RMAddr[2])
			{
				continue;
			}
			return ListNo;
		}
	}
	
	x=Terminal_Router->NoteNum;//已知总从节点数

	d64a=MRR((u32)p8,6);
	for(i=0;i<x;i++)
	{
		d64b=MRR((u32)&NoteList->List[i].CollectorAddr,6);
		d64b=R_Inverse(d64b,6);
		if(d64a==d64b)
		{
			d64b=MRR((u32)&NoteList->List[i].Addr,6);
			d64b=R_Inverse(d64b,6);
			MWR(d64b,(u32)p8,6);
			Addr0=p8[0]|(p8[1]<<8);
			Addr1=p8[2]|(p8[3]<<8);
			Addr2=p8[4]|(p8[5]<<8);
			break;//原已存在
		}
	}
//	p8=(u8*)ADDR_Meter_Collector;
//	for(i=0;i<NUM_RMmax;i++)
//	{
//		Data_Inverse((u32)p8+6,6);
//		pAddr=(u16*)(p8+6);
//		if(pAddr[0]==Addr0)
//		{
//			if(pAddr[1]==Addr1)
//			{
//				if(pAddr[2]==Addr2)
//				{
//					Data_Inverse((u32)p8,6);
//					Addr0=p8[0]|(p8[1]<<8);
//					Addr1=p8[2]|(p8[3]<<8);
//					Addr2=p8[4]|(p8[5]<<8);
//					Data_Inverse((u32)p8,6);
//					break;
//				}
//			}
//		}
//		Data_Inverse((u32)p8+6,6);
//		p8+=12;
//	}
	
	for(ListNo=0;ListNo<NUM_RMLISTmax;ListNo++)
	{
		ListTask=RMLIST->List[ListNo].TASK;////0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
		if((ListTask>=1)&&(ListTask<=6))//0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
		{//有效
			if(Addr0!=RMLIST->List[ListNo].RMAddr[0])
			{
				continue;
			}
			if(Addr1!=RMLIST->List[ListNo].RMAddr[1])
			{
				continue;
			}
			if(Addr2!=RMLIST->List[ListNo].RMAddr[2])
			{
				continue;
			}
			return ListNo;
		}
	}
	return ListNo;
}

u32 AddrComp(u8* p8)
{
	u64 d64a;
	u64 d64b;
	int i;
	
	d64a=MRR((u32)p8,6);
	d64a=R_Inverse(d64a,6);
	for(i=0;i<NUM_RMmax;i++)
	{
		d64b=MRR((u32)&NoteList->List[i].Addr,6);
		if((d64a==d64b))//&&(NoteList->List[i].user==0))
			return 0;
		if(d64b==0)
			break;
	}
	return 1;
}

u32 CompListRMAddr(u8* p8)//抄表地址与缓冲中有效中的抄表地址比较是否有相同;入口:p8指向地址(数据类型后);返回:列表号(从0开始,>=NUM_RMLISTmax表示没找到)
{
	u32 ListNo;
	u32 ListTask;
	u32 Addr0;
	u32 Addr1;
	u32 Addr2;
	
	Addr0=p8[0]|(p8[1]<<8);
	Addr1=p8[2]|(p8[3]<<8);
	Addr2=p8[4]|(p8[5]<<8);
	for(ListNo=0;ListNo<NUM_RMLISTmax;ListNo++)
	{
		ListTask=RMLIST->List[ListNo].TASK;////0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
		if((ListTask>=1)&&(ListTask<=6))//0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
		{//有效
			if(Addr0!=RMLIST->List[ListNo].RMAddr[0])
			{
				continue;
			}
			if(Addr1!=RMLIST->List[ListNo].RMAddr[1])
			{
				continue;
			}
			if(Addr2!=RMLIST->List[ListNo].RMAddr[2])
			{
				continue;
			}
			return ListNo;
		}
	}
	return ListNo;
}

void IncAndCheckTxSEQ(u32 PORTn)//发送帧序号+1,同时检查帧序号是否与缓冲中等待接收的帧序号是否有相同，若有相同则再加1
{
	u32 i;
	u32 ListNo;
	u32 ListTask;
	u32 TxSEQ;
	UARTCtrl_TypeDef * UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	TxSEQ=UARTCtrl->TxSEQ;
	for(i=0;i<256;i++)
	{
		TxSEQ++;
		TxSEQ&=0xff;
		for(ListNo=0;ListNo<NUM_RMLISTmax;ListNo++)
		{
			ListTask=RMLIST->List[ListNo].TASK;////0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
			if((ListTask>=3)&&(ListTask<=6))//0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
			{//有效
				if(TxSEQ==RMLIST->List[ListNo].TxSEQ)
				{
					break;
				}
			}
		}
		if(ListNo>=NUM_RMLISTmax)
		{
			UARTCtrl->TxSEQ=TxSEQ;
			return;
		}
	}
	UARTCtrl->TxSEQ=TxSEQ;
}

void ConcurrencyRx(u32 PORTn)//并发接收与超时定时,超时状态
{
	u32 i;
	u32 ListTask;
	u32 ListNo;
	u16* p16timer;
	UARTCtrl_TypeDef * UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
	for(ListNo=0;ListNo<NUM_RMLISTmax;ListNo++)
	{
		ListTask=RMLIST->List[ListNo].TASK;//0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
		if(ListTask==5)
		{//正在接收
			i=RMLIST->List[ListNo].TIMER_S;//并发启动发送后等待接收秒分定时
			if(i==0)
			{
				RMLIST->List[ListNo].TASK=2;//0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
				if(Terminal_Router->NUM_Enable_Concurrency<5)//宽带载波当前还允许并发帧数
				{
					Terminal_Router->NUM_Enable_Concurrency++;//宽带载波当前还允许并发帧数
				}
			}
			else
			{
				UARTCtrl->Task=5;//总状态正在接收
				i*=1000/10;
				if(i>p16timer[0])
				{
					p16timer[0]=i;
				}
			}
		}
	}
	
