gdgly/NUC97X_JS/STM32F4xx/DL698/RM_3762_iActive_HPLC.c
}

void Uart_3762_AFNF1F1_Tx(u32 PORTn,u32 Protocol,u32 ADDR_Data,u32 LEN_Data,u32 LEN_ESC,u32 DelayFlag)//376.2监控从节点数据填入发送区;入口:端口,通信协议(1=1997,2=2007),标准645帧地址,645帧长度,预计应答字节数,通信延时相关标志
{
	u8 * p8tx;
	UARTCtrl_TypeDef * UARTCtrl;
	u64 d64a;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
	
	p8tx[0]=0x68;
	p8tx[1]=(29+LEN_Data+2);//需总发送字节数
	p8tx[2]=(29+LEN_Data+2)>>8;
	if(Terminal_Router->RouterRunMode_1==2)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
	{
		p8tx[3]=0x43;//控制码;集中式路由载波通信
	}
	else
	{
		if(Terminal_Router->RouterRunMode_1==3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
		{
			p8tx[3]=0x4a;//控制码;微功率无线通信
		}
		else
		{
			p8tx[3]=0x41;//控制码;集中式路由载波通信
		}
	}
	p8tx[4]=4;//通信模块标识=1
	p8tx[5]=0;
	p8tx[6]=LEN_ESC;//预计应答字节数
	p8tx[7]=0;
	p8tx[8]=0;
	//UARTCtrl->TxSEQ++;//启动帧序列域SEQ(每次加1后发送(非发送后加1),等待响应时不变,以便比较)
	IncAndCheckTxSEQ(PORTn);//发送帧序号+1,同时检查帧序号是否与缓冲中等待接收的帧序号是否有相同，若有相同则再加1
	p8tx[9]=UARTCtrl->TxSEQ;//启动帧序列域SEQ(每次加1后发送(非发送后加1),等待响应时不变,以便比较)
	MR(((u32)p8tx)+10,(u32)&Terminal_Router->RouterAddr,6);//主节点地址(源地址)
	//MR(((u32)p8tx)+16,ADDR_Data+1,6);//从节点地址(目的地址)
	d64a=UARTCtrl->RMAddr[2];
	d64a<<=16;
	d64a|=UARTCtrl->RMAddr[1];
	d64a<<=16;
	d64a|=UARTCtrl->RMAddr[0];
	d64a=R_Inverse(d64a,6);
	MWR(d64a,((u32)p8tx)+16,6);//从节点地址(目的地址)
	
	p8tx[22]=0xF1;//AFN=F1H
	p8tx[23]=0x1;//Fn=1
	p8tx[24]=0;
	p8tx[25]=Protocol;//2;//转发数据标识类型=0透明传输,1=DL645-1997,2=DL645-2007
	p8tx[26]=0;//保留
	p8tx[27]=LEN_Data;//报文长度
	p8tx[28]=LEN_Data>>8;
	MR(((u32)p8tx)+29,ADDR_Data,LEN_Data);//标准645帧

	Uart_3762_CS((u32)p8tx);//和校验计算并写入(同时写入结束0x16)和比较,返回0=正确1=错误,入口接收或发送缓冲
}

void RM_3762_iActive_HPLC(u32 PORTn)//集中器主动抄表(宽带载波并发抄表)
{
	u32 i;
	u32 x;
	u32 ListNo;
	u32 ListTask;
	u32 id;
  UARTCtrl_TypeDef * UARTCtrl;
	u8* p8rx;
	u8* p8tx;
	u16* p16timer;
	u32 SetNo;
	u32 Info;
#if SEL_RouterRunMode3ADDR==1//微功率无线发送帧目标地址:0=电能表地址，1=采集器地址
	u8* pCSD;
	u64 d64a;
#endif
	u32 y;
	u64 d64b;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	if(UARTCtrl->Lock==0x55)
	{
		return;//0x55=通信功能正在被调用禁止其他程序再次调用
	}
	switch(UARTCtrl->Task)//0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送)
	{
		case 0://0=空闲
			UARTCtrl->Task=6;//3;//启动发送
			break;
		case 2://2=接收超时(或错误)
			UARTCtrl->Task=0;//空闲1次
			break;
		case 3://3=启动发送
			break;
		case 5://5=正在接收
			if(UARTCtrl->RxByte!=0)
			{
				p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
				if(p16timer[0]>(1000/10))
				{
					p16timer[0]=1000/10;
				}
				return;
			}
		case 6://6=抄表发送(同RS485的3=启动发送)
			//代理任务
			i=0;
			if(UARTCtrl->ProxyTask>=1)//代理任务:0=空,1=有代理,2...=正在代理过程,完成结束后回0
			{
				i=1;
			}
			//广播校时任务
			if((UARTCtrl->BroadcastTimeTask&0x7f)>=1)//广播校时任务:0=空,1=校时-2等待开始,2-127校时-2过程;0x81=校时-3等待开始,0x82-0xFF校时-3过程
			{
				i=1;
			}
			//自动搜表任务
			if(UARTCtrl->AutoSearchTask>=1)//自动搜表任务:0=空,1=等待,2...过程
			{
				i=1;
			}
			//电能表主动上报任务
			if(UARTCtrl->AutoReportTask>=1)//电能表主动上报任务:0=空,1=有主动上报等待读取,2...抄读中
			{
				i=1;
			}
			ConcurrencyRx(PORTn);//并发接收与超时定时,超时状态
			//有其他任务等待,停止并发
//			if(UARTCtrl->Task!=5)
//			{
				if(i)
				{
					UARTCtrl->Task=0;//空闲
					return;
				}
//			}
			p16timer=(u16 *)(ADDR_Terminal_MS_Timer+4);//集中器时用于终端收到路由模块数据帧后到发送延时定时器
			i=p16timer[0];
			if(i!=0)
			{
			#if (USER/100)==0//电科院测试
				if(i>(5000/10))//下帧启动发送延时
				{
					p16timer[0]=5000/10;
				}
//				if(i>(4000/10))
//				{
//					//读状态
//					Uart_3762_TxData(PORTn,0x10,4,0);//376.2发送数据填入发送区;入口时若有信息域目的地址数据单元等则已填入且数据单元暂固定填入发送缓冲区+128地址
//				}
			#else
				//if(i>(1000/10))//下帧启动发送延时
				//{
					//p16timer[0]=1000/10;
				//}
			#endif
				break;
			}
			UARTCtrl->RMMeterCountAuto=0;//抄表电能表自动加1计数,0=自动,1=不自动(路由模块主动)
			if(UARTCtrl->RTCS_TASK!=Comm_Ram->DL698YMDHMS[6])//实时钟更新标志原始秒(Task运算)
			{
				UARTCtrl->RTCS_TASK=Comm_Ram->DL698YMDHMS[6];//实时钟更新标志原始秒(Task运算)
				TASK(PORTn,1);//采集任务;TaskID=b31-b28优先级,b27-b24方案类型,b23-b20采集类型,b19-b16存储时标类型,b15-b8任务号,b7-b0方案编号
			}
			i=UARTCtrl->TaskID;
			if(i==0)//如果当前没有任务在跑
			{
				p16timer[0]=1000/10;//下次计算TASK()延时;注：376.2每接收到1帧会置30/10值
				UARTCtrl->Task=5;//正在接收
				RM_NUM_Display(PORTn);//抄表数量显示
				WarningOccur(PORTn,(u8 *)"载波 当前任务完成");//告警发生,入口告警代码和告警字符串
				return;
			}
			//缓冲列表任务
			for(ListNo=0;ListNo<NUM_RMLISTmax;ListNo++)
			{
				ListTask=RMLIST->List[ListNo].TASK;//0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
				if(ListTask<=2)
				{//0=空闲,1=完成1帧发收,2=接收超时(或错误)
					break;
				}
			}
			if(ListNo>=NUM_RMLISTmax)
			{//没找到空或完成1帧发收或接收超时
				//查停用
				for(ListNo=0;ListNo<NUM_RMLISTmax;ListNo++)
				{
					ListTask=RMLIST->List[ListNo].TASK;//0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
					if(ListTask==7)
					{
						ListTask=0;
						RMLIST->List[ListNo].TASK=0;//该表任务从0开始
						break;
					}
				}
				if(ListNo>=NUM_RMLISTmax)
				{//没停用
					UARTCtrl->Task=5;//正在接收
					return;
				}
			}
			i=Terminal_Router->NUM_Enable_Concurrency;//宽带载波当前还允许并发帧数
			if(i==0)
			{
				for(i=0;i<NUM_RMLISTmax;i++)
				{
					if(RMLIST->List[i].TASK==5)
					{//有在等待接收
						UARTCtrl->Task=5;//正在接收
						return;
					}
				}
				Terminal_Router->NUM_Enable_Concurrency=5;//宽带载波当前还允许并发帧数
			}
			
			id=UARTCtrl->TaskID;
			id>>=8;
			id&=0xff;
			UARTCtrl->SourMeterCount_id=UARTCtrl->MeterCount[id];//并发处理时当前任务id的原始抄表电能表计数
			switch(ListTask)
			{
				case 0://0=空闲
					Clr_RMListRMCount(ListNo);//清抄表计数相关数据;入口:ListNo=列表号从0开始
					MC(0xFF,(u32)&UARTCtrl->RMAddr,6);
					break;
				case 1://1=完成1帧发收
					break;
				case 2://2=接收超时(或错误)
					i=AddrToMeterSetNoJS((u16*)&RMLIST->List[ListNo].RMAddr);//搜索通信地址在采集档案配置表中的序号;返回:从0开始的配置序号,>=NUM_RMmax表示无效
					//i=AddrToMeterSetNo((u16*)&RMLIST->List[ListNo].RMAddr);//搜索通信地址在采集档案配置表中的序号;返回:从0开始的配置序号,>=NUM_RMmax表示无效
					
					i=AddrToMeterSetNoJS((u16*)&UARTCtrl->RMAddr);//搜索通信地址在采集档案配置表中的序号;返回:从0开始的配置序号,>=NUM_RMmax表示无效
					if(i>=NUM_RMmax)
					{//无效
						Clr_RMListRMCount(ListNo);//清抄表计数相关数据;入口:ListNo=列表号从0开始
						MC(0xFF,(u32)&UARTCtrl->RMAddr,6);
					}
					else
					{
						UARTCtrl->MeterCount[id]=i;//变更电能表计数
						MR((u32)&UARTCtrl->RMAddr,(u32)&RMLIST->List[ListNo].RMAddr,6);
					}
					break;
			}
			Load_RMCount_NoCompAddr(PORTn,ListNo);//得到抄表计数相关数据(不比较地址);入口:ListNo=列表号从0开始
			UARTCtrl->PIID=RMLIST->List[ListNo].PIID;//PIID的值在当前就改变(一开始从0开始)
			p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
			p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
			if(UARTCtrl->ReRMCount>=3)//抄表重发计数
			{
				RM_OK_FAIL(PORTn,0);//抄表成功失败地址记录:入口:OK=0失败，=1成功
				UARTCtrl-> ReRMCount=0;//抄表重发计数
				UARTCtrl->RM_OKFAIL=0;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
				//下电能表
				RMLIST->List[ListNo].TASK=0;//0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送)
				Clr_RMListRMCount(ListNo);//清抄表计数相关数据;入口:ListNo=列表号从0开始 
				MC(0xFF,(u32)&UARTCtrl->RMAddr,6);
				Load_RMCount_NoCompAddr(PORTn,ListNo);//得到抄表计数相关数据(不比较地址);入口:ListNo=列表号从0开始
				UARTCtrl->MeterCount[id]=UARTCtrl->SourMeterCount_id;//并发处理时当前任务id的原始抄表电能表计数
				RM_MeterCount(PORTn);//电能表计数+1;返回:0=没抄完,1=抄完
				Find_Next_CollectAddr(PORTn,id);
			}

