gdgly/NUC97X_JS/STM32F4xx/DL698/RM_3762_iActive_HPLC.c
			if(UARTCtrl->RM_SubsequentFrames==0)//0=无读后续帧,1-n=读续帧的帧号
			{//非后续帧
				UARTCtrl->RMMeterCountAuto=0;//抄表电能表自动加1计数,0=自动,1=不自动(路由模块主动)
			#if(USER/100)==17//江苏系
				if((((UARTCtrl->TaskID>>20)&0xf)==5)&&(Terminal_Router->MinuteCollect==1))
				//if(((UARTCtrl->TaskID>>20)&0xf)==5)
					UARTCtrl->RMprotocol=3;
			#endif
				i=RM_TxDATA_Manage(PORTn);//抄表发送数据帧管理;返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
				//注:RM_TxDATA_Manage(PORTn)会清UARTCtrl-> ReRMCount=0
				//Get_ReRMCount(PORTn);//得到抄表重发计数,取入到UARTCtrl->ReRMCount
				UARTCtrl->ReRMCount++;//抄表重发计数
				
				if(UARTCtrl->TxByte==0)
				{//不需抄
					RMLIST->List[ListNo].TASK=0;//0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送)
					//注:调用Save_RMCount（）会将成功表又置为失败!!!
					//Save_RMCount(PORTn,ListNo);//保存抄表计数相关数据;入口:ListNo=列表号从0开始
					UARTCtrl->MeterCount[id]=UARTCtrl->SourMeterCount_id;//并发处理时当前任务id的原始抄表电能表计数
					ConcurrencyRx(PORTn);//并发接收与超时定时,超时状态
					UARTCtrl->Task=5;//正在接收
					//myprintf("[%s:%d]:载波发送的字节为0,不需要抄读\n",(u32)&__func__,(u32)__LINE__,0);
					return;
				}
				i=CompListRMAddr((u8*)&UARTCtrl->RMAddr);//抄表地址与缓冲中有效中的抄表地址比较是否有相同;入口:p8指向地址(数据类型后);返回:列表号(从0开始,>=NUM_RMLISTmax表示没找到)
				if(Terminal_Router->MinuteCollect==1)//如果载波支持分钟采集就不比较这一项
				{
					i=NUM_RMLISTmax;
				}
				if((i<NUM_RMLISTmax)&&(i!=ListNo))
				{//当前地址原有列表号已存在,且当前的列表号和原列表号不同
					RMLIST->List[ListNo].TASK=7;//7=停用(为了能执行下个列表号)
					UARTCtrl->MeterCount[id]=UARTCtrl->SourMeterCount_id;//并发处理时当前任务id的原始抄表电能表计数
					ConcurrencyRx(PORTn);//并发接收与超时定时,超时状态
					RM_MeterCount(PORTn);//电能表计数+1;返回:0=没抄完,1=抄完
					UARTCtrl->Task=5;//正在接收
					return;
				}
				MW((u32)&UARTCtrl->RMAddr,(u32)&RMLIST->List[ListNo].RMAddr,6);
				if(UARTCtrl->RMprotocol==3)//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
				{
					i=100;//预计应答字节数
				}
				else
				{
					i=0;//预计应答字节数
				}
			#if (USER/100)==0//电科院测试验
				Uart_3762_AFNF1F1_Tx(PORTn,UARTCtrl->RMprotocol,(u32)p8tx+128,UARTCtrl->TxByte,i,0);//376.2监控从节点数据填入发送区;入口:端口,通信协议(1=1997,2=2007),标准645帧地址,645帧长度,预计应答字节数,通信延时相关标志
			#else
				if(Comm_Ram->RouterType==2)//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=讯能,8=钱龙
				{//鼎信无698暂用透明
					if(UARTCtrl->RMprotocol==3)
					{
						Uart_3762_AFNF1F1_Tx(PORTn,0,(u32)p8tx+128,UARTCtrl->TxByte,i,0);//376.2监控从节点数据填入发送区;入口:端口,通信协议(1=1997,2=2007),标准645帧地址,645帧长度,预计应答字节数,通信延时相关标志
					}
					else
					{
						Uart_3762_AFNF1F1_Tx(PORTn,UARTCtrl->RMprotocol,(u32)p8tx+128,UARTCtrl->TxByte,i,0);//376.2监控从节点数据填入发送区;入口:端口,通信协议(1=1997,2=2007),标准645帧地址,645帧长度,预计应答字节数,通信延时相关标志
					}
				}
				else
				{
					Uart_3762_AFNF1F1_Tx(PORTn,UARTCtrl->RMprotocol,(u32)p8tx+128,UARTCtrl->TxByte,i,0);//376.2监控从节点数据填入发送区;入口:端口,通信协议(1=1997,2=2007),标准645帧地址,645帧长度,预计应答字节数,通信延时相关标志
				}
			#endif
			#if(USER/100)==17//江苏系
				i=UARTCtrl->TaskID;
				i>>=8;
				i&=0xff;
				if(i==0x22)
				{
					if((((UARTCtrl->TaskID>>20)&0xf)==5)&&(Terminal_Router->MinuteCollect==1))
					{
						switch(i)
						{
							case RMTASKnoPOWER://停上电事件固定任务号
								i=UARTCtrl->MeterCount[i];
								i=PowerEvent->setno[i];
								break;
							default:
								i=UARTCtrl->MeterCount[i];
								break;
						}
						if(i>=NUM_RMmax)
						{
							UARTCtrl->Task=5;//正在接收
							return;
						}
						x=Terminal_Router->NoteNum;//已知总从节点数
						d64a=MRR((u32)p8tx+16,6);
						for(y=0;y<x;y++)
						{
							d64b=MRR((u32)&NoteList->List[y].Addr,6);
							if(d64a==d64b)
							{
								d64b=MRR((u32)&NoteList->List[y].CollectorAddr,6);
								d64b=R_Inverse(d64b,6);
								MWR(d64b,((u32)p8tx)+16,6);//从节点地址(目的地址)
								Uart_3762_CS((u32)p8tx);
								break;//原已存在
							}
						}
					}
				}
			#endif
			#if SEL_RouterRunMode3ADDR==1//微功率无线发送帧目标地址:0=电能表地址，1=采集器地址
				if(Terminal_Router->RouterRunMode_1==3)//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
				{//微功率无线,目标地址用采集器地址
					i=UARTCtrl->TaskID;
					i>>=8;
					i&=0xff;
					switch(i)
					{
						case RMTASKnoPOWER://停上电事件固定任务号
							i=UARTCtrl->MeterCount[i];
							i=PowerEvent->setno[i];
							break;
						default:
							i=UARTCtrl->MeterCount[i];
							break;
					}
					if(i>=NUM_RMmax)
					{
						UARTCtrl->Task=5;//正在接收
						return;
					}
					d64a=0;
					pCSD=(u8*)ADDR_6000_SDRAM+(i*LENper_6000);
					pCSD=Get_Element(pCSD,3,0,0);//计算元素地址
					if(pCSD)
					{//采集器可取
						d64a=MRR((u32)pCSD+5,6);//取配置采集器地址(目的地址)
						d64a=R_Inverse(d64a,6);
					}
					if((d64a!=0xeeeeeeeeeeee)&&(d64a!=0))
					{
						MWR(d64a,((u32)p8tx)+16,6);//从节点地址(目的地址)
						Uart_3762_CS((u32)p8tx);//和校验计算并写入(同时写入结束0x16)和比较,返回0=正确1=错误,入口接收或发送缓冲
					}
				}
			#endif
				//Terminal_Router->NUM_Enable_Concurrency--;//宽带载波当前还允许并发帧数
			}
			else
			{//是后续帧
				UARTCtrl-> ReRMCount++;//抄表重发计数
				//p8tx[0]=0x68;
				p8tx[1]=(29+17+2);//需总发送字节数
				p8tx[2]=(29+17+2)>>8;
				//p8tx[3]=0x41;//控制码为0x41
				//p8tx[4]=4;//通信模块标识=1
				//p8tx[5]=0;
				p8tx[6]=0;//预计应答字节数
				//p8tx[7]=0;
				//p8tx[8]=0;
				//UARTCtrl->TxSEQ++;//启动帧序列域SEQ(每次加1后发送(非发送后加1),等待响应时不变,以便比较)
				IncAndCheckTxSEQ(PORTn);//发送帧序号+1,同时检查帧序号是否与缓冲中等待接收的帧序号是否有相同，若有相同则再加1
				p8tx[9]=UARTCtrl->TxSEQ;//启动帧序列域SEQ(每次加1后发送(非发送后加1),等待响应时不变,以便比较)
				//MR(((u32)p8tx)+10,(u32)&Terminal_Router->RouterAddr,6);//主节点地址(源地址)
				//MR(((u32)p8tx)+16,ADDR_Data+1,6);//从节点地址(目的地址)
				//p8tx[22]=0x13;//AFN=13H
				//p8tx[23]=1;//Fn=1
				//p8tx[24]=0;
				//p8tx[25]=2;//转发数据标识类型=0透明传输,1=DL645-1997,2=DL645-2007
				//p8tx[26]=0;//保留
				p8tx[27]=17;//DL645报文长度
				p8tx[28]=0;
				p8tx[29+8]=0x12;
				p8tx[29+9]=5;
				p8tx[29+14]=UARTCtrl->RM_SubsequentFrames+0x33;
				p8tx[29+15]=0;//cs
				for(i=0;i<15;i++)
				{
					p8tx[29+15]+=p8tx[29+i];
				}
				p8tx[29+16]=0x16;
				Uart_3762_CS((u32)p8tx);//和校验计算并写入(同时写入结束0x16)和比较,返回0=正确1=错误,入口接收或发送缓冲
				UARTCtrl->TxByte=29+17+2;//发送字节数(半字对齐)
			}
			UARTCtrl->TxByte=p8tx[1]+(p8tx[2]<<8);//发送字节数(半字对齐)
			i=Terminal_Router->MaxOverTime*(1000/10);//从节点监控最大超时时间秒
			UARTCtrl->TxToRxTimerOver=i;
			UARTCtrl->Task=3;//启动发送
			RM_ADDR_Display(PORTn);//抄表地址显示
			//Comm_Ram->DisplayScanTimer=0;//立即显示
			i=UARTCtrl->TaskID;//b31-b28优先级,b27-b24方案类型,b23-b20采集类型,b19-b16存储时标类型,b15-b8任务号,b7-b0方案编号
			i>>=8;
			i&=0xff;
			RM_Monitor_TxNUM(i,1);//采集任务监控;入口:ID=任务号,NUM_Tx=发送条数

			Save_RMCount(PORTn,ListNo);//保存抄表计数相关数据;入口:ListNo=列表号从0开始
			UARTCtrl->MeterCount[id]=UARTCtrl->SourMeterCount_id;//并发处理时当前任务id的原始抄表电能表计数
			RMLIST->List[ListNo].TASK=5;//并发任务:0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
			//i=Terminal_Router->MaxOverTime;
			RMLIST->List[ListNo].TIMER_S=120;//并发启动发送后等待接收分秒定时
			RMLIST->List[ListNo].TxSEQ=UARTCtrl->TxSEQ;//启动帧序列域SEQ(每次加1后发送(非发送后加1),等待响应时不变,以便比较)
			break;
		case 1://1=接收完成
			UARTCtrl->Task=0;//空闲1次
			//myprintf("[%s:%d]:接受完成之后的处理\n",(u32)&__func__,(u32)__LINE__,0);
			UARTCtrl->RxByte=0;
			Terminal_Ram->RouterCheck_S_Timer=RouterCheckTimerVal;//(60*10)//载波路由器死机秒定时值
			
			p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
			
			i=p8rx[1]+(p8rx[2]<<8);
			if(i<=16)
			{//确认否认
				i=p8rx[10]+(p8rx[11]<<8)+(p8rx[12]<<16);
				if(i==0x0200)
				{//否认回答
					i=p8rx[9];//SEQ
					for(ListNo=0;ListNo<NUM_RMLISTmax;ListNo++)
					{
						if(RMLIST->List[ListNo].TxSEQ==i)
						{
							break;
						}
					}
					if(ListNo<NUM_RMLISTmax)
					{//找到
						Load_RMCount_NoCompAddr(PORTn,ListNo);//得到抄表计数相关数据(不比较地址);入口:ListNo=列表号从0开始
						if(UARTCtrl->ReRMCount)//连继重发次数计数
						{
							UARTCtrl->ReRMCount--;//连继重发次数计数
						}
						i=p8rx[13];
						switch(i)
						{
					//CCO端回复否认帧给集中器,有以下可能原因:
							case 109://0x6d
							case 110://0x6e
					//a）集中器下发的抄表报文的并发个数超过CCO允许的最大值，错误原因为109（超过最大并发数）;  
					//b）每个并发读表帧中可以承载多条电表协议报文，若集中器下发报文中的电表协议报文条数超过允许的最大值，CCO返回否认帧，错误原因为110（超过单个Q/GDW 1376.2帧最大允许的电表协议报文条数）; 
								Terminal_Router->NUM_Enable_Concurrency=0;//宽带载波当前还允许并发帧数
								RMLIST->List[ListNo].TASK=1;//并发任务:0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
								break;
							case 111://0x6f
								//RM_MeterCount(PORTn);//电能表计数+1;返回:0=没抄完,1=抄完
								//Find_Next_CollectAddr(PORTn,id);
					//c）集中器抄表时，不允许并发给同一块电表多条抄表报文，即集中器下发第二条抄表报文的前提是要等到第一条抄表报文的回复。否则，CCO将返回否认帧，错误原因为111（该表正在抄读中）; 
								//RMLIST->List[ListNo].TASK=7;//7=停用(为了能执行下个列表号)
								if(Terminal_Router->MinuteCollect==1)
								{
									UARTCtrl->Task=5;//载波接受一次
								}
								RMLIST->List[ListNo].TASK=5;//并发任务:0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
								//RMLIST->List[ListNo].TIMER_S=240;//并发启动发送后等待接收秒定时
								break;
							case 9://载波在做别的事情
							default:
					//d）当CCO端组网以及路由优化还未完成时，不允许抄表，如果此时集中器发送读表帧给CCO时，CCO会返回否认帧，错误原因为9（CCO模块忙，不允许抄表）。 
								RMLIST->List[ListNo].TASK=1;//并发任务:0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
								break;
						}
						Save_RMCount(PORTn,ListNo);//保存抄表计数相关数据;入口:ListNo=列表号从0开始
					}
				}
				ConcurrencyRx(PORTn);//并发接收与超时定时,超时状态	
				return;
			}
		
			id=UARTCtrl->TaskID;//b31-b28优先级,b27-b24方案类型,b23-b20采集类型,b19-b16存储时标类型,b15-b8任务号,b7-b0方案编号
			id>>=8;
			id&=0xff;
			RM_Monitor_RxNUM(id,1);//采集任务监控;入口:ID=任务号,NUM_Rx=接收条数
			ConcurrencyRx(PORTn);//并发接收与超时定时,超时状态

			if(Terminal_Router->MinuteCollect==0)//不是分钟采集才会去判断这一项
			{
				MR((u32)&UARTCtrl->RMAddr,((u32)p8rx)+10,6);//从节点地址(目的地址)
				Data_Inverse((u32)&UARTCtrl->RMAddr,6);//数据倒序(高低字节调换),入口Le>=2
			}
			ListNo=Get_ListNo((u8*)&UARTCtrl->RMAddr);//得到并发列表号;入口:抄表地址;返回:列表号0-(NUM_RMLISTmax-1)(>=NUM_RMLISTmax表示无效)
			if(ListNo>=NUM_RMLISTmax)
			{
				ConcurrencyRx(PORTn);//并发接收与超时定时,超时状态
				return;
			}
			Load_RMCount_NoCompAddr(PORTn,ListNo);//得到抄表计数相关数据(不比较地址);入口:ListNo=列表号从0开始
			
			i=p8rx[22]+(p8rx[23]<<8)+(p8rx[24]<<16);
			if(i!=0x1F1)
			{//AFN=F1H,Fn=1
				//继续接收
				Save_RMCount(PORTn,ListNo);//保存抄表计数相关数据;入口:ListNo=列表号从0开始
				ConcurrencyRx(PORTn);//并发接收与超时定时,超时状态
				return;
			}
			
			x=p8rx[26]+(p8rx[27]<<8);//返回数据域长度
			if(x==0)
			{//接收数据长度=0,没收到帧也返回长度0
				RMLIST->List[ListNo].TASK=1;//并发任务:0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
				Save_RMCount(PORTn,ListNo);//保存抄表计数相关数据;入口:ListNo=列表号从0开始
				ConcurrencyRx(PORTn);//并发接收与超时定时,超时状态
				//i=UARTCtrl->MeterCount[id];
				//i++;
				//UARTCtrl->MeterCount[id]=i;
				//Find_Next_CollectAddr(PORTn,id);
				return;
			}
			Info=p8rx[4]+(p8rx[5]<<8)+(p8rx[6]<<16)+(p8rx[7]<<24);
			MR((u32)p8rx,((u32)p8rx)+28,x);
			for(i=0;i<x;i++)
			{//去返回帧的前导0xfe
				if(p8rx[i]!=0xfe)
				{
					if(i!=0)
					{
						MR((u32)p8rx,((u32)p8rx)+i,x-i);
					}
					break;
				}
			}
			if(Terminal_Router->MinuteCollect==1)
			{
				i=0;//抄表组帧的地址有问题先强制通过
			}else
			{	
				i=RM_RxDATA_CHECK(PORTn);//帧接收数据检查,比较发收地址、控制码、数据标识、减0x33;返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
			if((i==1)||(i==3))
			{//1地址错,3数据标识错
				//继续接收
				Save_RMCount(PORTn,ListNo);//保存抄表计数相关数据;入口:ListNo=列表号从0开始
				ConcurrencyRx(PORTn);//并发接收与超时定时,超时状态
				return;
			}
			if(i==4)
			{//4主动上报(已处理)
				//继续接收
				Save_RMCount(PORTn,ListNo);//保存抄表计数相关数据;入口:ListNo=列表号从0开始
				ConcurrencyRx(PORTn);//并发接收与超时定时,超时状态
				return;
			}
			UARTCtrl->RM_Rx_date_NULL=i;//抄表接收返回:0=有数据,!=0无数据(空数据)
			if(i==2)
			{//2控制码错(无数据)
//				UARTCtrl->RMCSDSubCount++;//抄表CSD子计数
//				UARTCtrl->ReRMCount=0;//抄表重发计数
//				return;
			#if (USER/100)==15//安徽
				//安徽:针对三相表需要支持06000001和061000FF等块抄读
				if(UARTCtrl->RM_DI==0x06000001)
				{
					//继续接收
					Save_RMCount(PORTn,ListNo);//保存抄表计数相关数据;入口:ListNo=列表号从0开始
					ConcurrencyRx(PORTn);//并发接收与超时定时,超时状态
					return;
				}
			#endif
				//曲线等冻结数据当指定时间点无数据冻结时写入空数据避免补抄时重新抄读
				i=(UARTCtrl->RMCSD[2]<<8)|UARTCtrl->RMCSD[3];
				x=(UARTCtrl->TaskID>>20)&0xf;//采集类型
				if(!((i==0x5002)||(x==4)))
				{//不是抄分钟冻结(采曲线数据)和补抄(2=事件采集方案时会填入空数据而上报)
					UARTCtrl->RMCSDSubCount++;//抄表CSD子计数
					UARTCtrl->ReRMCount=0;//抄表重发计数
					RMLIST->List[ListNo].TASK=1;//并发任务:0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送),7=停用(为了能执行下个列表号)
					Save_RMCount(PORTn,ListNo);//保存抄表计数相关数据;入口:ListNo=列表号从0开始
					ConcurrencyRx(PORTn);//并发接收与超时定时,超时状态
					return;
				}
			}
			UARTCtrl->SourMeterCount_id=UARTCtrl->MeterCount[id];//并发处理时当前任务id的原始抄表电能表计数
		
		#if (USER/100)==17//江苏系
			if(id==0x22)
			{
				if((((UARTCtrl->TaskID>>20)&0xf)==5)&&(Terminal_Router->MinuteCollect==1))
				//if(((UARTCtrl->TaskID>>20)&0xf)==5)
					SetNo=AddrToMeterSetNoJS((u16*)&RMLIST->List[ListNo].RMAddr);
				else
					SetNo=AddrToMeterSetNo((u16*)&RMLIST->List[ListNo].RMAddr);//搜索通信地址在采集档案配置表中的序号;返回:从0开始的配置序号,>=NUM_RMmax表示无效

