gdgly/NUC97X_JS/STM32F4xx/DL698/RM_3762_iActive_HPLC.c
			}
			else
				SetNo=AddrToMeterSetNo((u16*)&RMLIST->List[ListNo].RMAddr);//搜索通信地址在采集档案配置表中的序号;返回:从0开始的配置序号,>=NUM_RMmax表示无效
		#else
			SetNo=AddrToMeterSetNo((u16*)&RMLIST->List[ListNo].RMAddr);//搜索通信地址在采集档案配置表中的序号;返回:从0开始的配置序号,>=NUM_RMmax表示无效
		#endif	
			
		
			//UARTCtrl->MeterCount[id]=SetNo;
			
//		#if(USER/100)==17//江苏系
//			pMeterAddrNo=MeterSetAddrNo((u16*)&RMLIST->List[ListNo].RMAddr);
//			
//		#endif
			RM_RxDATA(PORTn);//抄表接收数据处理
			RM_State_RMUpDate(PORTn,1,SetNo,(Info>>4)&0xf,(Info>>16)&0xf);//采集状态,每次抄表后更新:入口:OK=0失败=1成功,OK=1时Class=中继级别,Phase=相位
			UARTCtrl->ReRMCount=0;//抄表重发计数
		#if(USER/100)==17//江苏系
			if(UARTCtrl->res23==5)//0=无读后续帧,1-n=读续帧的帧号
			{//无后续帧
				RM_OK_FAIL(PORTn,1);//抄表成功失败地址记录:入口:OK=0失败，=1成功
				UARTCtrl-> ReRMCount=0;//抄表重发计数
				UARTCtrl->RM_OKFAIL=1;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
				//下电能表
				RMLIST->List[ListNo].TASK=0;//0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送)
				Clr_RMListRMCount(ListNo);//清抄表计数相关数据;入口:ListNo=列表号从0开始 
				Load_RMCount_NoCompAddr(PORTn,ListNo);//得到抄表计数相关数据(不比较地址);入口:ListNo=列表号从0开始
				UARTCtrl->MeterCount[id]=UARTCtrl->SourMeterCount_id;//并发处理时当前任务id的原始抄表电能表计数
				RM_MeterCount(PORTn);//电能表计数+1;返回:0=没抄完,1=抄完
				Find_Next_CollectAddr(PORTn,id);//
				UARTCtrl->res23=0;
			}
			else
			{
				UARTCtrl->RMCSDSubCount++;//抄表CSD子计数
				RMLIST->List[ListNo].TASK=1;//并发任务:0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送)
				Save_RMCount(PORTn,ListNo);//保存抄表计数相关数据;入口:ListNo=列表号从0开始
				UARTCtrl->res23=3;//发后续的8806
				//UARTCtrl->MeterCount[id]=UARTCtrl->SourMeterCount_id;//并发处理时当前任务id的原始抄表电能表计数
			}
		#else
			UARTCtrl->RMCSDSubCount++;//抄表CSD子计数
			RMLIST->List[ListNo].TASK=1;//并发任务:0=空闲,1=完成1帧发收,2=接收超时(或错误),3=启动发送,4=正在发送,5=正在接收,6=抄表发送(同RS485的3=启动发送)
			Save_RMCount(PORTn,ListNo);//保存抄表计数相关数据;入口:ListNo=列表号从0开始
			UARTCtrl->MeterCount[id]=UARTCtrl->SourMeterCount_id;//并发处理时当前任务id的原始抄表电能表计数
		#endif
			
			RMLIST->List[ListNo].res23=UARTCtrl->res23;
//			RMLIST->List[ListNo].MinuteCollect=UARTCtrl->MinuteCollect;
			RMLIST->List[ListNo].PIID=UARTCtrl->PIID;
			

	}
}

#endif


